docs/Topics/Personal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-15 Sun 12:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Personal</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Personal</h1>
<div id="outline-container-orgbd18b33" class="outline-2">
<h2 id="orgbd18b33">Meditation</h2>
<div class="outline-text-2" id="text-orgbd18b33">
<p>
I practice lovingkindness meditation, with the general goal of cultivating mindfulness and the brahmaviharas (lovingkindness, compassion, sympathetic joy, equanimity), integrating them into my life.<br />
</p>

<p>
I tried a number of different approaches to learning meditation, but the most effective technique for me has been the one I learned from going to a Tranquil Wisdom Insight Meditation retreat in 2023 with Bhante Kusula. There I learned a combination of forgiveness practice and lovingkindess practice, and it was the first time I was able to experience the practice in a deep enough way to unlock deep feelings of compassion and self-love.<br />
</p>
</div>
<div id="outline-container-orgcf08a66" class="outline-3">
<h3 id="orgcf08a66">Forgiveness Meditation</h3>
<div class="outline-text-3" id="text-orgcf08a66">
<p>
I credit forgiveness meditation <a href="https://www.dhammasukha.org/forgiveness-meditation#comp-kefxjy6t5label">as taught by TWIM</a> with softening my heart, helping me let go of personal baggage, and preparing me for this practice. Some extra color here is that I could only rarely cry before using this method, but now I regularly get moved to beautiful tears - &ldquo;tears are the fruits of forgiveness,&rdquo; as one teacher put it. Here is a great <a href="https://www.youtube.com/watch?v=bLS8X-JjxN8">guided forgiveness meditation</a> by Delson Armstrong, which teaches how to make the relief of forgiveness the object of meditation, and how to use right effort/4Rs to stay collected on it.<br />
</p>
</div>
</div>
<div id="outline-container-orgefc4ffe" class="outline-3">
<h3 id="orgefc4ffe">Meditation as a way to embrace reality</h3>
<div class="outline-text-3" id="text-orgefc4ffe">
<p>
Something I like about TWIM-style practice is that it doesn&rsquo;t encourage meditation as escape; the point is to remain collected on the object as hindrances come up, which means that it is full of opportunities to observe how the minds attention moves around suffering and resentments.<br />
</p>
</div>
</div>
<div id="outline-container-org771a4ef" class="outline-3">
<h3 id="org771a4ef">IPF</h3>
<div class="outline-text-3" id="text-org771a4ef">
<p>
I&rsquo;ve also been practicing ideal parent figure meditations through mettagroup.org.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org5b8e0b5" class="outline-2">
<h2 id="org5b8e0b5">Clowning</h2>
<div class="outline-text-2" id="text-org5b8e0b5">
<p>
I love clowning an art form and spiritual practice. For me, clown is about discovering a way to play innocently and fluidly. It has greatly widened my range of expression emotion.<br />
</p>

<p>
I&rsquo;ve performed at open mikes and variety shows around Manhattan, and studied with teachers in the <a href="https://en.wikipedia.org/wiki/Canadian_clowning">Pochinko</a>, <a href="https://en.wikipedia.org/wiki/Philippe_Gaulier">Gaulier</a> and Red-Nose traditions.<br />
</p>

<blockquote>
<p>
Pochinko taught clowning as a sort of &ldquo;reverse therapy&rdquo;, in which instead of<br />
ridding oneself of anxieties, the clown performer leans into their own<br />
insecurities and foibles in order to package them as comedy.<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5b4d4b1" class="outline-2">
<h2 id="org5b4d4b1">Burning man</h2>
<div class="outline-text-2" id="text-org5b4d4b1">
<p>
I went to burning man once (2024) and had a great time. I might go back.<br />
</p>

<p>
Take aways:<br />
</p>

<ul class="org-ul">
<li>It&rsquo;s worthwhile to make things beautiful, even though they are transient. At burning man we build a beautiful world that lasts only a week.<br /></li>

<li>There are a lot of misconceptions about burning man &#x2013; often people think it&rsquo;s a festival about sex, drugs and <del>rock-and-roll</del> tech-house. It <b>can</b> be those things, but it is so much more; it can provide nearly whatever experience you&rsquo;re looking for. For me, it&rsquo;s about participating in art, strange and genuine social connections, making and deepening friendships and living in a society that embodies the 10 principles of burning man.<br /></li>

<li>Living in a culture that valued radical self-expression, participation and immediacy in the way Black Rock City did <a href="https://burningman.org/about/10-principles/">(see the 10 principles)</a> re-socialized me to be less afraid of joining spontaneous social games with people. This meshes well with my experiences with clowning.<br /></li>

<li>I went to lecture about embodied ways of approaching mathematical problem solving, which inspired me to <a href="Math.html#org81d62bc">work more on my mathematical problem solving skills</a> with a tutor who helped refactor both my understanding of foundational concepts, and improve my emotional relationship to problem-solving and mathematics overall.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org0f36768" class="outline-2">
<h2 id="org0f36768"><a href="Music.html">Music</a></h2>
<div class="outline-text-2" id="text-org0f36768">
<p>
I like music, and also make music on the piano and in ableton and strudel. Recently I&rsquo;ve been singing more also.<br />
</p>
</div>
</div>
<div id="outline-container-org4c5b23a" class="outline-2">
<h2 id="org4c5b23a"><a href="Consumerism.html">Tools I Like</a></h2>
<div class="outline-text-2" id="text-org4c5b23a">
<p>
Things that benefit me through their consumption<br />
</p>
</div>
</div>
<div id="outline-container-orgaa42e1a" class="outline-2">
<h2 id="orgaa42e1a">Thought consumption:</h2>
<div class="outline-text-2" id="text-orgaa42e1a">
</div>
<div id="outline-container-orgb7496d1" class="outline-3">
<h3 id="orgb7496d1">Blogs:</h3>
<div class="outline-text-3" id="text-orgb7496d1">
<p>
Here are some blogs that have influenced me:<br />
</p>
</div>
<div id="outline-container-org0354964" class="outline-4">
<h4 id="org0354964"><a href="https://tasshin.com/">Tasshin Fogelman</a></h4>
</div>
<div id="outline-container-orgb538570" class="outline-4">
<h4 id="orgb538570"><a href="https://slatestarcodex.com/">Slate Star Codex</a></h4>
</div>
<div id="outline-container-orgfd63aad" class="outline-4">
<h4 id="orgfd63aad"><a href="https://x.com/visakanv/highlights">Visa Veerasamy</a></h4>
</div>
<div id="outline-container-org0fbad98" class="outline-4">
<h4 id="org0fbad98">Gwern</h4>
<div class="outline-text-4" id="text-org0fbad98">
</div>
<ul class="org-ul">
<li><a id="org1db9cb3"></a><a href="https://gwern.net/choosing-software">Choosing Software</a>, which reinforced my conviction that Emacs is excellent.<br /></li>
</ul>
</div>
<div id="outline-container-orgee30630" class="outline-4">
<h4 id="orgee30630">Nicholas Carlini</h4>
<div class="outline-text-4" id="text-orgee30630">
</div>
<ul class="org-ul">
<li><a id="org9a83d71"></a><a href="https://nicholas.carlini.com/writing/2024/how-i-use-ai.html#mobilelinks">How I use &ldquo;AI&rdquo;</a><br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-03-15 Sun 12:35</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
